docs: github theme images, mermaid diagrams
